const app = new Vue({
    el: "#app",
    data: {
        items: [
            {
                name: 'Джинсовый ремень из натуральной кожи',
                mainImage: './image/1/360_360.png',
                description: "Мужской джинсовый ремень сегмента люкс из итальянской кожи растительного дубления фабрики: MBpellami (Тоскана, Италия). Кожа в меру плотная, отличной толщины 4 мм, сквозного анилинового окрашивания с использованием масел и восков, с заглаженной обратной стороной. На лицевой стороне встречаются прожилки животного, местами с разбивкой, отчего ремень выглядит еще интереснее и подчеркивает индивидуальность владельца.<br/>При подготовке коожи использовались компоненты только растительного присхождения, изделия из такой кожи гипоалергенны и не содержат в своем составе тяжелых металлов и других соединений вредных для здоровья человека.<br/>Каждый ремень изготавливается под конкретный размер человека, который будет его носить.",
                price: "4 500",
                extraImages: ['./image/1/300_300_1.png', './image/1/300_300_2.png', './image/1/300_300_3.png']
            },
            {
                name: 'Ретрокошелек с отделом под карты',
                mainImage: './image/2/360_360.png',
                description: "Ретрокошелек в современнй интерпретации. Позволяет вместить небольшое количество наличных и 5-6 карт. Второй отдел позволяет хранить монеты или что там еще у девушек в кошельках бывает.<br/>Кожа коза италия фабрики Falco pellami растительного дубления ярко красного цвета. Потрясающий запах итактильные ощущения. Взяв один раз в руки не хочется выпускать.<br/>Пошит руками седельным швом. Цветовая гамма нитей придает подчеркивает статусность изделия и его владельца. Нить это 100% лён, без использования синтетических материалов. При подготовке кожииспользовались компоненты только растительного происхождения, изделия из такой кожи гипоалергенны и не содержат в своем составе тяжелых металлов и других соединений вредных для здоровья человека.",
                price: "3 500",
                extraImages: ['./image/2/300_300.png', './image/2/300_300_1.png', './image/2/300_300_2.png']
            },
            {
                name: 'Картхолдер с потайным карманом',
                mainImage: './image/3/360_360.png',
                description: "Кожа козы Falco pellami растительного дубления. Картхолдер в подарок на 6 карт и небольшими потайными отсеками. Цвет бордо - солидный глубокий цвет. Простой и функциональный. Карты надежно защищены от потери и повреждения в кармане.<br/>Тонкий и легкий хорошо помещается в карман летней рубашки или шорт.<br/>При подготовке кожи использовались компоненты только растительного происхождения, изделия из такой кожи гипоалергенны и не содержат в своем составе тяжелых металлов и других соединений вредных для здоровья человека.",
                price: "5 000",
                extraImages: ['./image/3/300_300_1.png', './image/3/300_300_2.png', './image/3/300_300_3.png']
            },
            {
                name: 'Документ-органайзер портативного размера',
                mainImage: './image/1/360_360.png',
                description: "Элегантный органайзер под авто документы, паспорт, пластиковые карты, паспорт. Обложка выполнена из итальянской кожи Pueblo, внутреннее наполнение выполненно и тонкой но необычно крепкой кожи козы.<br/>Вся кожа италия, растительного дубления, сочетание нескольких цветов придает изделию оригинальный вид. В наполненном документами и картами состоянии помещается в нагрудный карман мужской рубашки.<br/>При изготовлении использовалась линянная нить природного происхождения. На обложке возможно нанесение имени или монограммы.",
                price: "4 500",
                extraImages: ['./image/1/300_300_1.png', './image/1/300_300_2.png', './image/1/300_300_3.png']
            },
            {
                name: 'Кожаные часовые ремешки',
                mainImage: './image/1/360_360.png',
                description: "Кожаный ремешок для часов на заказ, подходит для большинства часов. Есть два варианта конструкции: классический и широкий брутальный, оба варианта выполняются из натуральной кожи, фурнитура обычно остается оригинальная, т.е. от вашего старого ремешка или браслета.<br/>При подготовке кожи использовались компоненты только растительного происхождения, изделия из такой кожи гипоалергенны и не содержат в своем составе тяжелых металлов и других соединений вредных для здоровья человека.<br/>Каждый ремешок изготавливается под конкретный размер часов. Срок эксплуатации одного ремешка около 1 года, ограничен гигиеническими мотивами.",
                price: "4 500",
                extraImages: ['./image/1/300_300_1.png', './image/1/300_300_2.png', './image/1/300_300_3.png']
            },

        ],
        reviews: [
            {
                img: './image/vlad.png',
                review: 'Сразу скажу что качество изделия 10 из 10, как минимум не уступает сегменту lux, а где-то даже превосходит его. Я поклонник выражения цена-качество, но тут мону ответственно заявить, что цена для такой продукции низковата, редко такое встретишь.<br/><br/>Владислав Соловей.',
            },
            {
                img: './image/vlad.png',
                review: 'Сразу скажу что качество изделия 10 из 10, как минимум не уступает сегменту lux, а где-то даже превосходит его. Я поклонник выражения цена-качество, но тут мону ответственно заявить, что цена для такой продукции низковата, редко такое встретишь.<br/><br/>Владислав Соловей.',
            },
            {
                img: './image/vlad.png',
                review: 'Сразу скажу что качество изделия 10 из 10, как минимум не уступает сегменту lux, а где-то даже превосходит его. Я поклонник выражения цена-качество, но тут мону ответственно заявить, что цена для такой продукции низковата, редко такое встретишь.<br/><br/>Владислав Соловей.',
            },
            {
                img: './image/vlad.png',
                review: 'Сразу скажу что качество изделия 10 из 10, как минимум не уступает сегменту lux, а где-то даже превосходит его. Я поклонник выражения цена-качество, но тут мону ответственно заявить, что цена для такой продукции низковата, редко такое встретишь.<br/><br/>Владислав Соловей.',
            },
        ]
    },
    methods: {
        
    },
})