const app = new Vue({
    el: "#app",
    data: {
        items: [
            {
                name: 'Джинсовый ремень из натуральной кожи',
                mainImage: './image/1/360_360.png',
                description: "Мужской джинсовый ремень сегмента люкс из итальянской кожи растительного дубления фабрики: MBpellami (Тоскана, Италия). Кожа в меру плотная, отличной толщины 4 мм, сквозного анилинового окрашивания с использованием масел и восков, с заглаженной обратной стороной. На лицевой стороне встречаются прожилки животного, местами с разбивкой, отчего ремень выглядит еще интереснее и подчеркивает индивидуальность владельца.<br/>При подготовке коожи использовались компоненты только растительного присхождения, изделия из такой кожи гипоалергенны и не содержат в своем составе тяжелых металлов и других соединений вредных для здоровья человека.<br/>Каждый ремень изготавливается под конкретный размер человека, который будет его носить.",
                price: "4 500",
                extraImages: ['./image/1/300_300_1.png', './image/1/300_300_2.png', './image/1/300_300_3.png']
            },
            {
                name: 'Ретрокошелек с отделом под карты',
                mainImage: './image/2/360_360.png',
                description: "Мужской джинсовый ремень сегмента люкс из итальянской кожи растительного дубления фабрики: MBpellami (Тоскана, Италия). Кожа в меру плотная, отличной толщины 4 мм, сквозного анилинового окрашивания с использованием масел и восков, с заглаженной обратной стороной. На лицевой стороне встречаются прожилки животного, местами с разбивкой, отчего ремень выглядит еще интереснее и подчеркивает индивидуальность владельца.<br/>При подготовке коожи использовались компоненты только растительного присхождения, изделия из такой кожи гипоалергенны и не содержат в своем составе тяжелых металлов и других соединений вредных для здоровья человека.<br/>Каждый ремень изготавливается под конкретный размер человека, который будет его носить.",
                price: "3 500",
                extraImages: ['./image/2/300_300.png', './image/2/300_300_1.png', './image/2/300_300_2.png']
            },
            {
                name: 'Картхолдер с потайным карманом',
                mainImage: './image/3/360_360.png',
                description: "Мужской джинсовый ремень сегмента люкс из итальянской кожи растительного дубления фабрики: MBpellami (Тоскана, Италия). Кожа в меру плотная, отличной толщины 4 мм, сквозного анилинового окрашивания с использованием масел и восков, с заглаженной обратной стороной. На лицевой стороне встречаются прожилки животного, местами с разбивкой, отчего ремень выглядит еще интереснее и подчеркивает индивидуальность владельца.<br/>При подготовке коожи использовались компоненты только растительного присхождения, изделия из такой кожи гипоалергенны и не содержат в своем составе тяжелых металлов и других соединений вредных для здоровья человека.<br/>Каждый ремень изготавливается под конкретный размер человека, который будет его носить.",
                price: "5 000",
                extraImages: ['./image/3/300_300_1.png', './image/3/300_300_2.png', './image/3/300_300_3.png']
            },
            {
                name: 'Документ-органайзер портативного размера',
                mainImage: './image/1/360_360.png',
                description: "Мужской джинсовый ремень й обратной стороной. На лицевой стороне встречаются прожилки животного, местами с разбивкой, отчего ремень выглядит еще интереснее и подчеркивает индивидуальность владельца.<br/>При подготовке коожи исисхождения, изделия из такой кожи гипоалергенны и не содержат в своем составе тяжелых металлчеловека.<br/>Каждый ремень изготавливается который будет его носить.",
                price: "4 500",
                extraImages: ['./image/1/300_300_1.png', './image/1/300_300_2.png', './image/1/300_300_3.png']
            },
            {
                name: 'Кожаные часовые ремешки',
                mainImage: './image/1/360_360.png',
                description: "Мужской джинсовый ремень й обратной стороной. На лицевой стороне встречаются прожилки животного, местами с разбивкой, отчего ремень выглядит еще интереснее и подчеркивает индивидуальность владельца.<br/>При подготовке коожи исисхождения, изделия из такой кожи гипоалергенны и не содержат в своем составе тяжелых металлчеловека.",
                price: "4 500",
                extraImages: ['./image/1/300_300_1.png', './image/1/300_300_2.png', './image/1/300_300_3.png']
            },

        ],
        reviews: [
            {
                img: './image/vlad.png',
                review: 'Сразу скажу что качество изделия 10 из 10, как минимум не уступает сегменту lux, а где-то даже превосходит его. Я поклонник выражения цена-качество, но тут мону ответственно заявить, что цена для такой продукции низковата, редко такое встретишь.<br/><br/>Владислав Соловей.',
            },
            {
                img: './image/vlad.png',
                review: 'Сразу скажу что качество изделия 10 из 10, как минимум не уступает сегменту lux, а где-то даже превосходит его. Я поклонник выражения цена-качество, но тут мону ответственно заявить, что цена для такой продукции низковата, редко такое встретишь.<br/><br/>Владислав Соловей.',
            },
            {
                img: './image/vlad.png',
                review: 'Сразу скажу что качество изделия 10 из 10, как минимум не уступает сегменту lux, а где-то даже превосходит его. Я поклонник выражения цена-качество, но тут мону ответственно заявить, что цена для такой продукции низковата, редко такое встретишь.<br/><br/>Владислав Соловей.',
            },
            {
                img: './image/vlad.png',
                review: 'Сразу скажу что качество изделия 10 из 10, как минимум не уступает сегменту lux, а где-то даже превосходит его. Я поклонник выражения цена-качество, но тут мону ответственно заявить, что цена для такой продукции низковата, редко такое встретишь.<br/><br/>Владислав Соловей.',
            },
        ]
    },
    methods: {
        
    },
})